# Encoding Begins From Here

In [1]:
"""Encoding means changing the categorical data into numerial data"""

'Encoding means changing the categorical data into numerial data'

In [2]:
# For Encoding

"""Should know the type of categorical data
    i.e. Ordinal and Nominal Data Type
    Whre Ordinal is Data with Order and Nominal is Data with no Order"""

'Should know the type of categorical data\n    i.e. Ordinal and Nominal Data Type\n    Whre Ordinal is Data with Order and Nominal is Data with no Order'

In [3]:
# Importing the library

import pandas as pd

In [4]:
# Importing the file

dfile = pd.read_csv("Salary_Data.csv")
dfile.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [5]:
#Removin the null
dfile.isnull().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [6]:
dfile.dropna()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [7]:
# The above is ordinal data type since

In [8]:
# Checking the unique value

dfile['Education Level'].unique()

array(["Bachelor's", "Master's", 'PhD', nan, "Bachelor's Degree",
       "Master's Degree", 'High School', 'phD'], dtype=object)

In [9]:
# Column name
dfile.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [10]:
# Renaming the education level and years of experience

dfile =dfile.rename(columns={
    'Education Level': 'Education',
    'Years of Experience' : 'Experience'
})

In [11]:
dfile.head()

    Age  Gender   Education          Job Title  Experience    Salary
0  32.0    Male  Bachelor's  Software Engineer         5.0   90000.0
1  28.0  Female    Master's       Data Analyst         3.0   65000.0
2  45.0    Male         PhD     Senior Manager        15.0  150000.0
3  36.0  Female  Bachelor's    Sales Associate         7.0   60000.0
4  52.0    Male    Master's           Director        20.0  200000.0

In [12]:
dfile['Education']

0              Bachelor's
1                Master's
2                     PhD
3              Bachelor's
4                Master's
              ...
6699                  PhD
6700          High School
6701    Bachelor's Degree
6702      Master's Degree
6703          High School
Name: Education, Length: 6704, dtype: object

In [15]:
# For removing the inconsistency we, use replace function provided by panda as

dfile['Education'] = dfile['Education'].replace({
    "Bachelor's" : 'Bachelors',
    "Master's": 'Masters',
    "Bachelor's Degree": 'Bachelors',
    "Master's Degree": 'Masters',
    "phD" : 'PhD'
})

In [16]:
# Identifying the education value

dfile['Education'].unique()

array(['Bachelors', 'Masters', 'PhD', nan, 'High School'], dtype=object)

In [ ]:
# Encoding

dfile['Education'] = dfile['Education'].map({
    "High School" : 0,
    "" : ,
    "" : ,
    "" : ,
})